trade_exp/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РасходыПоОбъектам</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузкеПоНакладным</registerRecords>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>350</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="320b124d-3c29-46e8-853c-ed5d358989bd">
      <name>СтатьяРасходовБУ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="99d7a7fd-337f-4df2-a907-098ecb6044e6">
      <name>ОбъектРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="df20af94-0e4b-4c14-855e-7d1648302512">
      <name>АналитикаОбъекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="907c98f6-3522-4fae-9297-7d6f8a4c34d3">
    <name>ПутевыеЛисты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СебестоимостьТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <attributes extendedConfigurationObject="3d7f4871-4ad5-47c1-ae72-77ffba33a92e">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="935bd59c-89ae-4e2b-990a-97233617ce3d">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f8e7972-07b8-4c04-97a1-a6fcfdcd4b2c">
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ffeff26a-c1d5-4cb3-a410-81eb32db8022">
    <name>СтатьяРасходовСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e51bd0ad-2d52-4827-b5bb-83d36a080227">
    <name>АналитикаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dbe323e6-5da5-4078-bbcc-48cf76333c4b">
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f6a0080e-a2e3-4ed1-a4d2-42d9b01b3fbe">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="54deafa3-3c0c-49db-874d-0ed14fdd4781">
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3940101b-5682-4dc0-af5e-686005c0a991">
    <name>АналитикаУчетаПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/ПутевойЛист/ПутевойЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8c63e70a-01c7-47a3-a926-3460a02e9ce1">
  <name>ПутевойЛист</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e61f4fee-8525-41a9-ad21-be5907fea38b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="af4bbbdf-bdd0-4a2b-92f0-69dfe7f6ad3e">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="534f0f68-ab73-4b73-b4aa-76c411d4db64">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e280b4b8-12da-43b1-9c21-e2885a49f131">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="469b028e-bc82-483a-80b7-b022c3e41a51">
    <name>Топливо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba54b8a0-0ed3-49e6-83ee-c66e6d0ac540">
    <name>СпидометрВозвращение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d758c7d1-0de0-4e12-b6cc-a671edd235ee">
    <name>РасходПоНорме</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="145d6da9-b26d-4e2c-987d-05777d491692">
    <name>РасходФактический</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e8810ab8-d445-4a82-ba44-3f386eefbf93">
    <name>ИзменитьПоказания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2300f4d4-aa5d-43dc-ae90-c4147d7f8ab1">
    <name>СпидометрНачало</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3fbaa6f1-d561-4ea9-b6e0-ef526257b5bb">
    <name>НормаРасхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea7c213a-f9d3-4a24-9790-2d7b86c61133">
    <name>Механик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1efb3216-0528-4a44-a248-8f25eebff858">
    <name>АдресПодачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="071f68be-a1cf-4538-a6ef-544948485ede">
    <name>ОстатокПриВыезде</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="789aac2b-5008-4c5d-ab96-5bf9fed580fb">
    <name>ОстатокПриВозвращении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="181e9c13-926d-4768-b010-98a1a9e4f3d8">
    <name>Маршруты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b599da77-70b0-488a-b526-9366a08b2bc9">
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2c1473bf-f604-40b5-bbef-89fd2debcfdf">
      <name>МестоОтправления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7965af58-cbdc-4643-a593-4ef31e9c9b97">
      <name>МестоНазначения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c0e3b695-1aed-4e99-9fde-1c366a175a6d">
      <name>Обратно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="982b0fa0-6a0c-4a13-96c0-a35920f238e3">
      <name>Пройдено</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>7</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d706ee5a-4249-475e-9efd-2fc655f52d0d">
      <name>ВремяВыезда</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>5</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3ece1aac-c39f-4cab-9539-f0a58be2b0a3">
      <name>ВремяВозвращения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>5</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ВнутреннееПотребление/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполненияПосле(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Перем РеквизитыШапки;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Если ДанныеЗаполнения.Свойство("МассивЗаказов") И ДанныеЗаполнения.МассивЗаказов.Количество() > 0 Тогда
			Комментарий= ДанныеЗаполнения.МассивЗаказов[0].Комментарий;
		КонецЕсли; 

		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ПутевыеЛисты") Тогда
			ДанныеЗаполнения.Свойство("РеквизитыШапки", РеквизитыШапки);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);
			Товары.Загрузить(ТаблЧастьТоваров(ДанныеЗаполнения.ПутевыеЛисты)[0].Выгрузить());
			ПутевыеЛисты.Загрузить(ТаблЧастьТоваров(ДанныеЗаполнения.ПутевыеЛисты)[1].Выгрузить());
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры   

Функция ТаблЧастьТоваров(МассивДокументов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПутевойЛист.Топливо КАК Номенклатура,
		|	СУММА(ПутевойЛист.РасходФактический) КАК Количество,
		|	СУММА(ПутевойЛист.РасходФактический) КАК КоличествоУпаковок,
		|	ПутевойЛист.ТранспортноеСредство.СтатьяРасходов КАК СтатьяРасходов,
		|	ПутевойЛист.ТранспортноеСредство.АналитикаРасходов КАК АналитикаРасходов
		|ИЗ
		|	Документ.ПутевойЛист КАК ПутевойЛист
		|ГДЕ
		|	ПутевойЛист.Ссылка В(&МассивДокументов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПутевойЛист.Топливо,
		|	ПутевойЛист.ТранспортноеСредство.СтатьяРасходов,
		|	ПутевойЛист.ТранспортноеСредство.АналитикаРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПутевойЛист.Ссылка КАК ПутевойЛист
		|ИЗ
		|	Документ.ПутевойЛист КАК ПутевойЛист
		|ГДЕ
		|	ПутевойЛист.Ссылка В(&МассивДокументов)";

	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);

	Результат = Запрос.ВыполнитьПакет();

    Возврат Результат;
	
КонецФункции

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |	ТаблицаТовары.АналитикаРасходов КАК АналитикаРасходов,
        |	ТаблицаТовары.СтатьяРасходов КАК СтатьяРасходов,
        |	ТаблицаТовары.ОбъектРасходов КАК ОбъектРасходов,
        |	ТаблицаТовары.АналитикаОбъекта КАК АналитикаОбъекта,
        |	СУММА(ВЫБОР
		|			КОГДА СебестоимостьТоваровОбороты.КоличествоРасход <> 0
		|				ТОГДА ТаблицаТовары.КоличествоУпаковок * (СебестоимостьТоваровОбороты.ДопРасходыПриход + СебестоимостьТоваровОбороты.СтоимостьРасход) / СебестоимостьТоваровОбороты.КоличествоРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма
        |ИЗ
        |	Документ.ВнутреннееПотребление.Товары КАК ТаблицаТовары
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Обороты(, , Регистратор, ) КАК СебестоимостьТоваровОбороты
        |		ПО ТаблицаТовары.Ссылка = СебестоимостьТоваровОбороты.Регистратор
        |			И  ТаблицаТовары.Номенклатура = СебестоимостьТоваровОбороты.АналитикаУчетаНоменклатуры.Номенклатура
        |ГДЕ
        |	ТаблицаТовары.Ссылка = &Ссылка
        |	И НЕ ТаблицаТовары.ОбъектРасходов = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
        |	И НЕ ТаблицаТовары.АналитикаОбъекта = ЗНАЧЕНИЕ(Справочник.АналитикаОбъекта.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
        |	ТаблицаТовары.АналитикаРасходов,
        |	ТаблицаТовары.СтатьяРасходов,
        |	ТаблицаТовары.ОбъектРасходов,
        |	ТаблицаТовары.АналитикаОбъекта";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.РасходыПоОбъектам.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.АналитикаРасходов = ВыборкаДетальныеЗаписи.АналитикаРасходов;
		Движение.СтатьяРасходов = ВыборкаДетальныеЗаписи.СтатьяРасходов;
		Движение.ОбъектРасходов = ВыборкаДетальныеЗаписи.ОбъектРасходов;
		Движение.АналитикаОбъекта = ВыборкаДетальныеЗаписи.АналитикаОбъекта;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	Движения.РасходыПоОбъектам.Записывать = Истина; 
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаТЧ Из Товары Цикл  
		
		Если НЕ СтрокаТЧ.ОбъектРасходов.Пустая() и СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ИндексМассива = СтрокаТЧ.НомерСтроки-1;
			ОбщегоНазначения.СообщитьПользователю("Нельзя по строке реквизит ""Объект расходов"" заполнить, а ""Аналитика объекта"" нет. Исправьте или очистите значения этих реквизитов в строке",, 
				"Объект.Товары[" + ИндексМассива + "].АналитикаОбъекта");
			Отказ = Истина;
		ИначеЕсли СтрокаТЧ.ОбъектРасходов.Пустая() и НЕ СтрокаТЧ.АналитикаОбъекта.Пустая() Тогда
			ИндексМассива = СтрокаТЧ.НомерСтроки-1;
			ОбщегоНазначения.СообщитьПользователю("Нельзя по строке реквизит ""Аналитика объекта"" заполнить, а ""Объект расходов"" нет. Исправьте или очистите значения этих реквизитов в строке",, 
				"Объект.Товары[" + ИндексМассива + "].ОбъектРасходов");
			Отказ = Истина;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&После("ПередУдалением")
Процедура Док_ПередУдалением(Отказ)
	ДопМодульСервер.ПроверитьНаличиеРасходногоОрдераНаТовары(Ссылка, Отказ);
КонецПроцедуры     

#КонецЕсли
